apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_adc_ver2.h
/****************************************************************************
 * arch/arm/src/imxrt/hardware/imxrt_adc_ver2.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_ADC_VER2_H
#define __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT_ADC_VER2_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "hardware/imxrt_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define IMXRT_LPADC_VERID_OFFSET    0x000000  /* Version ID Register */
#define IMXRT_LPADC_PARAM_OFFSET    0x000004  /* Parameter Register */
#define IMXRT_LPADC_CTRL_OFFSET     0x000010  /* LPADC Control Register */
#define IMXRT_LPADC_STAT_OFFSET     0x000014  /* LPADC Status Register */
#define IMXRT_LPADC_IE_OFFSET       0x000018  /* Interrupt Enable Register */
#define IMXRT_LPADC_DE_OFFSET       0x00001c  /* DMA Enable Register */
#define IMXRT_LPADC_CFG_OFFSET      0x000020  /* LPADC Configuration Register */
#define IMXRT_LPADC_PAUSE_OFFSET    0x000024  /* LPADC Pause Register */
#define IMXRT_LPADC_FCTRL_OFFSET    0x000030  /* LPADC FIFO Control Register */
#define IMXRT_LPADC_SWTRIG_OFFSET   0x000034  /* Software Trigger Register */
#define IMXRT_LPADC_CMDL1_OFFSET    0x000100  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH1_OFFSET    0x000104  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL2_OFFSET    0x000108  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH2_OFFSET    0x00010c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL3_OFFSET    0x000110  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH3_OFFSET    0x000114  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL4_OFFSET    0x000118  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH4_OFFSET    0x00011c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL5_OFFSET    0x000120  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH5_OFFSET    0x000124  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL6_OFFSET    0x000128  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH6_OFFSET    0x00012c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL7_OFFSET    0x000130  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH7_OFFSET    0x000134  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL8_OFFSET    0x000138  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH8_OFFSET    0x00013c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL9_OFFSET    0x000140  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH9_OFFSET    0x000144  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL10_OFFSET   0x000148  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH10_OFFSET   0x00014c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL11_OFFSET   0x000150  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH11_OFFSET   0x000154  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL12_OFFSET   0x000158  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH12_OFFSET   0x00015c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL13_OFFSET   0x000160  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH13_OFFSET   0x000164  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL14_OFFSET   0x000168  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH14_OFFSET   0x00016c  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_CMDL15_OFFSET   0x000170  /* LPADC Command Low Buffer Register */
#define IMXRT_LPADC_CMDH15_OFFSET   0x000174  /* LPADC Command High Buffer Register */
#define IMXRT_LPADC_RESFIFO_OFFSET  0x000300  /* LPADC Data Result FIFO Register */
#define IMXRT_LPADC_TCTRL0_OFFSET   0x0000c0  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL1_OFFSET   0x0000c4  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL2_OFFSET   0x0000c8  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL3_OFFSET   0x0000cc  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL4_OFFSET   0x0000d0  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL5_OFFSET   0x0000d4  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL6_OFFSET   0x0000d8  /* Trigger Control Register */
#define IMXRT_LPADC_TCTRL7_OFFSET   0x0000dc  /* Trigger Control Register */
#define IMXRT_LPADC_CV1_OFFSET      0x000200  /* Compare Value Register */
#define IMXRT_LPADC_CV2_OFFSET      0x000204  /* Compare Value Register */
#define IMXRT_LPADC_CV3_OFFSET      0x000208  /* Compare Value Register */
#define IMXRT_LPADC_CV4_OFFSET      0x00020c  /* Compare Value Register */

/* Register definitions *****************************************************/

#define IMXRT_LPADC1_VERID    (IMXRT_LPADC1_BASE + IMXRT_LPADC_VERID_OFFSET)
#define IMXRT_LPADC1_PARAM    (IMXRT_LPADC1_BASE + IMXRT_LPADC_PARAM_OFFSET)
#define IMXRT_LPADC1_CTRL     (IMXRT_LPADC1_BASE + IMXRT_LPADC_CTRL_OFFSET)
#define IMXRT_LPADC1_STAT     (IMXRT_LPADC1_BASE + IMXRT_LPADC_STAT_OFFSET)
#define IMXRT_LPADC1_IE       (IMXRT_LPADC1_BASE + IMXRT_LPADC_IE_OFFSET)
#define IMXRT_LPADC1_DE       (IMXRT_LPADC1_BASE + IMXRT_LPADC_DE_OFFSET)
#define IMXRT_LPADC1_CFG      (IMXRT_LPADC1_BASE + IMXRT_LPADC_CFG_OFFSET)
#define IMXRT_LPADC1_PAUSE    (IMXRT_LPADC1_BASE + IMXRT_LPADC_PAUSE_OFFSET)
#define IMXRT_LPADC1_FCTRL    (IMXRT_LPADC1_BASE + IMXRT_LPADC_FCTRL_OFFSET)
#define IMXRT_LPADC1_SWTRIG   (IMXRT_LPADC1_BASE + IMXRT_LPADC_SWTRIG_OFFSET)
#define IMXRT_LPADC1_CMDL1    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL1_OFFSET)
#define IMXRT_LPADC1_CMDH1    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH1_OFFSET)
#define IMXRT_LPADC1_CMDL2    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL2_OFFSET)
#define IMXRT_LPADC1_CMDH2    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH2_OFFSET)
#define IMXRT_LPADC1_CMDL3    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL3_OFFSET)
#define IMXRT_LPADC1_CMDH3    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH3_OFFSET)
#define IMXRT_LPADC1_CMDL4    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL4_OFFSET)
#define IMXRT_LPADC1_CMDH4    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH4_OFFSET)
#define IMXRT_LPADC1_CMDL5    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL5_OFFSET)
#define IMXRT_LPADC1_CMDH5    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH5_OFFSET)
#define IMXRT_LPADC1_CMDL6    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL6_OFFSET)
#define IMXRT_LPADC1_CMDH6    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH6_OFFSET)
#define IMXRT_LPADC1_CMDL7    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL7_OFFSET)
#define IMXRT_LPADC1_CMDH7    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH7_OFFSET)
#define IMXRT_LPADC1_CMDL8    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL8_OFFSET)
#define IMXRT_LPADC1_CMDH8    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH8_OFFSET)
#define IMXRT_LPADC1_CMDL9    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL9_OFFSET)
#define IMXRT_LPADC1_CMDH9    (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH9_OFFSET)
#define IMXRT_LPADC1_CMDL10   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL10_OFFSET)
#define IMXRT_LPADC1_CMDH10   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH10_OFFSET)
#define IMXRT_LPADC1_CMDL11   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL11_OFFSET)
#define IMXRT_LPADC1_CMDH11   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH11_OFFSET)
#define IMXRT_LPADC1_CMDL12   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL12_OFFSET)
#define IMXRT_LPADC1_CMDH12   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH12_OFFSET)
#define IMXRT_LPADC1_CMDL13   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL13_OFFSET)
#define IMXRT_LPADC1_CMDH13   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH13_OFFSET)
#define IMXRT_LPADC1_CMDL14   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL14_OFFSET)
#define IMXRT_LPADC1_CMDH14   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH14_OFFSET)
#define IMXRT_LPADC1_CMDL15   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDL15_OFFSET)
#define IMXRT_LPADC1_CMDH15   (IMXRT_LPADC1_BASE + IMXRT_LPADC_CMDH15_OFFSET)
#define IMXRT_LPADC1_RESFIFO  (IMXRT_LPADC1_BASE + IMXRT_LPADC_RESFIFO_OFFSET)
#define IMXRT_LPADC1_TCTRL0   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL0_OFFSET)
#define IMXRT_LPADC1_TCTRL1   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL1_OFFSET)
#define IMXRT_LPADC1_TCTRL2   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL2_OFFSET)
#define IMXRT_LPADC1_TCTRL3   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL3_OFFSET)
#define IMXRT_LPADC1_TCTRL4   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL4_OFFSET)
#define IMXRT_LPADC1_TCTRL5   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL5_OFFSET)
#define IMXRT_LPADC1_TCTRL6   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL6_OFFSET)
#define IMXRT_LPADC1_TCTRL7   (IMXRT_LPADC1_BASE + IMXRT_LPADC_TCTRL7_OFFSET)
#define IMXRT_LPADC1_CV1      (IMXRT_LPADC1_BASE + IMXRT_LPADC_CV1_OFFSET)
#define IMXRT_LPADC1_CV2      (IMXRT_LPADC1_BASE + IMXRT_LPADC_CV2_OFFSET)
#define IMXRT_LPADC1_CV3      (IMXRT_LPADC1_BASE + IMXRT_LPADC_CV3_OFFSET)
#define IMXRT_LPADC1_CV4      (IMXRT_LPADC1_BASE + IMXRT_LPADC_CV4_OFFSET)

#define IMXRT_LPADC2_VERID    (IMXRT_LPADC2_BASE + IMXRT_LPADC_VERID_OFFSET)
#define IMXRT_LPADC2_PARAM    (IMXRT_LPADC2_BASE + IMXRT_LPADC_PARAM_OFFSET)
#define IMXRT_LPADC2_CTRL     (IMXRT_LPADC2_BASE + IMXRT_LPADC_CTRL_OFFSET)
#define IMXRT_LPADC2_STAT     (IMXRT_LPADC2_BASE + IMXRT_LPADC_STAT_OFFSET)
#define IMXRT_LPADC2_IE       (IMXRT_LPADC2_BASE + IMXRT_LPADC_IE_OFFSET)
#define IMXRT_LPADC2_DE       (IMXRT_LPADC2_BASE + IMXRT_LPADC_DE_OFFSET)
#define IMXRT_LPADC2_CFG      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CFG_OFFSET)
#define IMXRT_LPADC2_PAUSE    (IMXRT_LPADC2_BASE + IMXRT_LPADC_PAUSE_OFFSET)
#define IMXRT_LPADC2_FCTRL    (IMXRT_LPADC2_BASE + IMXRT_LPADC_FCTRL_OFFSET)
#define IMXRT_LPADC2_SWTRIG   (IMXRT_LPADC2_BASE + IMXRT_LPADC_SWTRIG_OFFSET)
#define IMXRT_LPADC2_CMDL1    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL1_OFFSET)
#define IMXRT_LPADC2_CMDH1    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH1_OFFSET)
#define IMXRT_LPADC2_CMDL2    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL2_OFFSET)
#define IMXRT_LPADC2_CMDH2    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH2_OFFSET)
#define IMXRT_LPADC2_CMDL3    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL3_OFFSET)
#define IMXRT_LPADC2_CMDH3    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH3_OFFSET)
#define IMXRT_LPADC2_CMDL4    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL4_OFFSET)
#define IMXRT_LPADC2_CMDH4    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH4_OFFSET)
#define IMXRT_LPADC2_CMDL5    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL5_OFFSET)
#define IMXRT_LPADC2_CMDH5    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH5_OFFSET)
#define IMXRT_LPADC2_CMDL6    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL6_OFFSET)
#define IMXRT_LPADC2_CMDH6    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH6_OFFSET)
#define IMXRT_LPADC2_CMDL7    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL7_OFFSET)
#define IMXRT_LPADC2_CMDH7    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH7_OFFSET)
#define IMXRT_LPADC2_CMDL8    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL8_OFFSET)
#define IMXRT_LPADC2_CMDH8    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH8_OFFSET)
#define IMXRT_LPADC2_CMDL9    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL9_OFFSET)
#define IMXRT_LPADC2_CMDH9    (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH9_OFFSET)
#define IMXRT_LPADC2_CMDL10   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL10_OFFSET)
#define IMXRT_LPADC2_CMDH10   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH10_OFFSET)
#define IMXRT_LPADC2_CMDL11   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL11_OFFSET)
#define IMXRT_LPADC2_CMDH11   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH11_OFFSET)
#define IMXRT_LPADC2_CMDL12   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL12_OFFSET)
#define IMXRT_LPADC2_CMDH12   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH12_OFFSET)
#define IMXRT_LPADC2_CMDL13   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL13_OFFSET)
#define IMXRT_LPADC2_CMDH13   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH13_OFFSET)
#define IMXRT_LPADC2_CMDL14   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL14_OFFSET)
#define IMXRT_LPADC2_CMDH14   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH14_OFFSET)
#define IMXRT_LPADC2_CMDL15   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDL15_OFFSET)
#define IMXRT_LPADC2_CMDH15   (IMXRT_LPADC2_BASE + IMXRT_LPADC_CMDH15_OFFSET)
#define IMXRT_LPADC2_RESFIFO  (IMXRT_LPADC2_BASE + IMXRT_LPADC_RESFIFO_OFFSET)
#define IMXRT_LPADC2_TCTRL0   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL0_OFFSET)
#define IMXRT_LPADC2_TCTRL1   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL1_OFFSET)
#define IMXRT_LPADC2_TCTRL2   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL2_OFFSET)
#define IMXRT_LPADC2_TCTRL3   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL3_OFFSET)
#define IMXRT_LPADC2_TCTRL4   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL4_OFFSET)
#define IMXRT_LPADC2_TCTRL5   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL5_OFFSET)
#define IMXRT_LPADC2_TCTRL6   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL6_OFFSET)
#define IMXRT_LPADC2_TCTRL7   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL7_OFFSET)
#define IMXRT_LPADC2_CV1      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV1_OFFSET)
#define IMXRT_LPADC2_CV2      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV2_OFFSET)
#define IMXRT_LPADC2_CV3      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV3_OFFSET)
#define IMXRT_LPADC2_CV4      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV4_OFFSET)
#define IMXRT_LPADC2_TCTRL0   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL0_OFFSET)
#define IMXRT_LPADC2_TCTRL1   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL1_OFFSET)
#define IMXRT_LPADC2_TCTRL2   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL2_OFFSET)
#define IMXRT_LPADC2_TCTRL3   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL3_OFFSET)
#define IMXRT_LPADC2_TCTRL4   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL4_OFFSET)
#define IMXRT_LPADC2_TCTRL5   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL5_OFFSET)
#define IMXRT_LPADC2_TCTRL6   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL6_OFFSET)
#define IMXRT_LPADC2_TCTRL7   (IMXRT_LPADC2_BASE + IMXRT_LPADC_TCTRL7_OFFSET)
#define IMXRT_LPADC2_CV1      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV1_OFFSET)
#define IMXRT_LPADC2_CV2      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV2_OFFSET)
#define IMXRT_LPADC2_CV3      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV3_OFFSET)
#define IMXRT_LPADC2_CV4      (IMXRT_LPADC2_BASE + IMXRT_LPADC_CV4_OFFSET)

/* Register bit definitions *************************************************/

#define IMXRT_LPADC_VERID_RES                   (1 << 0)                                   /* Up to 16-bit differential/15-bit single ended resolution supported. */
#define IMXRT_LPADC_VERID_DIFFEN                (1 << 1)                                   /* Differential operation supported. CMDLa[DIFF] and CMDLa[ABSEL] control fields implemented. */
#define IMXRT_LPADC_VERID_MVI                   (1 << 3)                                   /* Multiple voltage reference inputs supported. */
#define IMXRT_LPADC_VERID_CSW_SHIFT             (4)                                        /* Channel Scale Width */
#define IMXRT_LPADC_VERID_CSW_MASK              (0x07 << IMXRT_LPADC_VERID_CSW_SHIFT)
#define IMXRT_LPADC_VERID_CSW_CSW_0             (0x0 << IMXRT_LPADC_VERID_CSW_SHIFT)       /* Channel scaling not supported. */
#define IMXRT_LPADC_VERID_CSW_CSW_1             (0x1 << IMXRT_LPADC_VERID_CSW_SHIFT)       /* Channel scaling supported. 1-bit CSCALE control field. */
#define IMXRT_LPADC_VERID_CSW_CSW_6             (0x6 << IMXRT_LPADC_VERID_CSW_SHIFT)       /* Channel scaling supported. 6-bit CSCALE control field. */
#define IMXRT_LPADC_VERID_VR1RNGI               (1 << 8)                                   /* Range control required. CFG[VREF1RNG] is implemented. */
#define IMXRT_LPADC_VERID_IADCKI                (1 << 9)                                   /* Internal clock source (and CFG[ADCKEN]) implemented. */
#define IMXRT_LPADC_VERID_CALOFSI               (1 << 10)                                  /* Offset calibration and offset trimming implemented. */
#define IMXRT_LPADC_VERID_MINOR_SHIFT           (16)                                       /* Minor Version Number */
#define IMXRT_LPADC_VERID_MINOR_MASK            (0xff << IMXRT_LPADC_VERID_MINOR_SHIFT)
#define IMXRT_LPADC_VERID_MAJOR_SHIFT           (24)                                       /* Major Version Number */
#define IMXRT_LPADC_VERID_MAJOR_MASK            (0xff << IMXRT_LPADC_VERID_MAJOR_SHIFT)

#define IMXRT_LPADC_PARAM_TRIG_NUM_MASK         (0xff)
#define IMXRT_LPADC_PARAM_TRIG_NUM_TRIG_NUM_8   (0x8)                                      /* 8 hardware triggers implemented */
#define IMXRT_LPADC_PARAM_FIFOSIZE_SHIFT        (8)                                        /* Result FIFO Depth */
#define IMXRT_LPADC_PARAM_FIFOSIZE_MASK         (0xff << IMXRT_LPADC_PARAM_FIFOSIZE_SHIFT)
#define IMXRT_LPADC_PARAM_FIFOSIZE_FIFOSIZE_16  (0x10 << IMXRT_LPADC_PARAM_FIFOSIZE_SHIFT) /* Result FIFO depth = 16 datawords. */
#define IMXRT_LPADC_PARAM_CV_NUM_SHIFT          (16)                                       /* Compare Value Number */
#define IMXRT_LPADC_PARAM_CV_NUM_MASK           (0xff << IMXRT_LPADC_PARAM_CV_NUM_SHIFT)
#define IMXRT_LPADC_PARAM_CV_NUM_CV_NUM_4       (0x4 << IMXRT_LPADC_PARAM_CV_NUM_SHIFT)    /* 4 compare value registers implemented */
#define IMXRT_LPADC_PARAM_CMD_NUM_SHIFT         (24)                                       /* Command Buffer Number */
#define IMXRT_LPADC_PARAM_CMD_NUM_MASK          (0xff << IMXRT_LPADC_PARAM_CMD_NUM_SHIFT)
#define IMXRT_LPADC_PARAM_CMD_NUM_CMD_NUM_15    (0xf << IMXRT_LPADC_PARAM_CMD_NUM_SHIFT)   /* 15 command buffers implemented */

