apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_adc_ver2.h
#define IMXRT_LPADC_CTRL_ADCEN                  (1 << 0)                                   /* LPADC is enabled. */
#define IMXRT_LPADC_CTRL_RST                    (1 << 1)                                   /* LPADC logic is reset. */
#define IMXRT_LPADC_CTRL_DOZEN                  (1 << 2)                                   /* LPADC is disabled in Doze mode. */
#define IMXRT_LPADC_CTRL_TRIG_SRC_SHIFT         (3)                                        /* Hardware trigger source selection */
#define IMXRT_LPADC_CTRL_TRIG_SRC_MASK          (0x03 << IMXRT_LPADC_CTRL_TRIG_SRC_SHIFT)
#define IMXRT_LPADC_CTRL_TRIG_SRC_TRIG_SRC_0    (0x0 << IMXRT_LPADC_CTRL_TRIG_SRC_SHIFT)   /* ADC_ETC hw trigger , and HW trigger are enabled */
#define IMXRT_LPADC_CTRL_TRIG_SRC_TRIG_SRC_1    (0x1 << IMXRT_LPADC_CTRL_TRIG_SRC_SHIFT)   /* ADC_ETC hw trigger is enabled */
#define IMXRT_LPADC_CTRL_TRIG_SRC_TRIG_SRC_2    (0x2 << IMXRT_LPADC_CTRL_TRIG_SRC_SHIFT)   /* HW trigger is enabled */
#define IMXRT_LPADC_CTRL_RSTFIFO                (1 << 8)                                   /* FIFO is reset. */

#define IMXRT_LPADC_STAT_RDY                    (1 << 0)                                   /* Result FIFO holding data above watermark level. */
#define IMXRT_LPADC_STAT_FOF                    (1 << 1)                                   /* At least one result FIFO overflow has occurred since the last time the flag was cleared. */
#define IMXRT_LPADC_STAT_ADC_ACTIVE             (1 << 8)                                   /* The LPADC is processing a conversion, running through the power up delay, or servicing a trigger. */
#define IMXRT_LPADC_STAT_TRGACT_SHIFT           (16)                                       /* Trigger Active */
#define IMXRT_LPADC_STAT_TRGACT_MASK            (0x07 << IMXRT_LPADC_STAT_TRGACT_SHIFT)
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_0        (0x0 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) associated with Trigger 0 currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_1        (0x1 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) associated with Trigger 1 currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_2        (0x2 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) associated with Trigger 2 currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_3        (0x3 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) from the associated Trigger number is currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_4        (0x4 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) from the associated Trigger number is currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_5        (0x5 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) from the associated Trigger number is currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_6        (0x6 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) from the associated Trigger number is currently being executed. */
#define IMXRT_LPADC_STAT_TRGACT_TRGACT_7        (0x7 << IMXRT_LPADC_STAT_TRGACT_SHIFT)     /* Command (sequence) from the associated Trigger number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_SHIFT           (24)                                       /* Command Active */
#define IMXRT_LPADC_STAT_CMDACT_MASK            (0x0f << IMXRT_LPADC_STAT_CMDACT_SHIFT)
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_0        (0x0 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* No command is currently in progress. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_1        (0x1 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Command 1 currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_2        (0x2 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Command 2 currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_3        (0x3 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_4        (0x4 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_5        (0x5 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_6        (0x6 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_7        (0x7 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_8        (0x8 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */
#define IMXRT_LPADC_STAT_CMDACT_CMDACT_9        (0x9 << IMXRT_LPADC_STAT_CMDACT_SHIFT)     /* Associated command number is currently being executed. */

#define IMXRT_LPADC_IE_FWMIE                    (1 << 0)                                   /* FIFO watermark interrupts are enabled. */
#define IMXRT_LPADC_IE_FOFIE                    (1 << 1)                                   /* FIFO overflow interrupts are enabled. */

#define IMXRT_LPADC_DE_FWMDE                    (1 << 0)                                   /* DMA request enabled. */

#define IMXRT_LPADC_CFG_TPRICTRL                (1 << 0)                                   /* If a higher priority trigger is received during command processing, the current conversion is completed (including averaging iterations if enabled) and stored to the RESFIFO before the higher priority trigger/command is initiated. Note that compare until true commands can be interrupted prior to resulting in a true conversion. */
#define IMXRT_LPADC_CFG_PWRSEL_SHIFT            (4)                                        /* Power Configuration Select */
#define IMXRT_LPADC_CFG_PWRSEL_MASK             (0x03 << IMXRT_LPADC_CFG_PWRSEL_SHIFT)
#define IMXRT_LPADC_CFG_PWRSEL_PWRSEL_0         (0x0 << IMXRT_LPADC_CFG_PWRSEL_SHIFT)      /* Level 1 (Lowest power setting) */
#define IMXRT_LPADC_CFG_PWRSEL_PWRSEL_1         (0x1 << IMXRT_LPADC_CFG_PWRSEL_SHIFT)      /* Level 2 */
#define IMXRT_LPADC_CFG_PWRSEL_PWRSEL_2         (0x2 << IMXRT_LPADC_CFG_PWRSEL_SHIFT)      /* Level 3 */
#define IMXRT_LPADC_CFG_PWRSEL_PWRSEL_3         (0x3 << IMXRT_LPADC_CFG_PWRSEL_SHIFT)      /* Level 4 (Highest power setting) */
#define IMXRT_LPADC_CFG_REFSEL_SHIFT            (6)                                        /* Voltage Reference Selection */
#define IMXRT_LPADC_CFG_REFSEL_MASK             (0x03 << IMXRT_LPADC_CFG_REFSEL_SHIFT)
#define IMXRT_LPADC_CFG_REFSEL_REFSEL_0         (0x0 << IMXRT_LPADC_CFG_REFSEL_SHIFT)      /* (Default) Option 1 setting. */
#define IMXRT_LPADC_CFG_REFSEL_REFSEL_1         (0x1 << IMXRT_LPADC_CFG_REFSEL_SHIFT)      /* Option 2 setting. */
#define IMXRT_LPADC_CFG_REFSEL_REFSEL_2         (0x2 << IMXRT_LPADC_CFG_REFSEL_SHIFT)      /* Option 3 setting. */
#define IMXRT_LPADC_CFG_PUDLY_SHIFT             (16)                                       /* Power Up Delay */
#define IMXRT_LPADC_CFG_PUDLY_MASK              (0xff << IMXRT_LPADC_CFG_PUDLY_SHIFT)
#define IMXRT_LPADC_CFG_PUDLY(d)                (((d) & 0xff) << IMXRT_LPADC_CFG_PUDLY_SHIFT)
#define IMXRT_LPADC_CFG_PWREN                   (1 << 28)                                  /* LPADC analog circuits are pre-enabled and ready to execute conversions without startup delays (at the cost of higher DC current consumption). When PWREN is set, the power up delay is enforced such that any detected trigger does not begin ADC operation until the power up delay time has passed. */

#define IMXRT_LPADC_PAUSE_PAUSEDLY_MASK         (0x1ff)                                    /* Pause Delay */
#define IMXRT_LPADC_PAUSE_PAUSEEN               (1 << 31)                                  /* Pause operation enabled */

#define IMXRT_LPADC_FCTRL_FCOUNT_MASK           (0x1f)
#define IMXRT_LPADC_FCTRL_FCOUNT_FCOUNT_0       (0x0)                                      /* No data stored in FIFO */
#define IMXRT_LPADC_FCTRL_FCOUNT_FCOUNT_1       (0x1)                                      /* 1 dataword stored in FIFO */
#define IMXRT_LPADC_FCTRL_FCOUNT_FCOUNT_2       (0x2)                                      /* 2 datawords stored in FIFO */
#define IMXRT_LPADC_FCTRL_FCOUNT_FCOUNT_4       (0x4)                                      /* 4 datawords stored in FIFO */
#define IMXRT_LPADC_FCTRL_FCOUNT_FCOUNT_8       (0x8)                                      /* 8 datawords stored in FIFO */
#define IMXRT_LPADC_FCTRL_FCOUNT_FCOUNT_16      (0x10)                                     /* 16 datawords stored in FIFO */
#define IMXRT_LPADC_FCTRL_FWMARK_SHIFT          (16)                                       /* Watermark level selection */
#define IMXRT_LPADC_FCTRL_FWMARK_MASK           (0x0f << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_0       (0x0 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 1st successful conversion - single conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_1       (0x1 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 2nd successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_2       (0x2 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 3rd successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_3       (0x3 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 4th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_4       (0x4 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 5th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_5       (0x5 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 6th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_6       (0x6 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 7th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_7       (0x7 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 8th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_8       (0x8 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 9th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_9       (0x9 << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 10th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_10      (0xa << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 11th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_11      (0xb << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 12th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_12      (0xc << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 13th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_13      (0xd << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 14th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_14      (0xe << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 15th successful conversion */
#define IMXRT_LPADC_FCTRL_FWMARK_FWMARK_15      (0xf << IMXRT_LPADC_FCTRL_FWMARK_SHIFT)    /* Generates STAT[RDY] flag after 16th successful conversion */

#define IMXRT_LPADC_SWTRIG_SWT0                 (1 << 0)                                   /* Trigger 0 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT1                 (1 << 1)                                   /* Trigger 1 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT2                 (1 << 2)                                   /* Trigger 2 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT3                 (1 << 3)                                   /* Trigger 3 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT4                 (1 << 4)                                   /* Trigger 4 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT5                 (1 << 5)                                   /* Trigger 5 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT6                 (1 << 6)                                   /* Trigger 6 event generated. */
#define IMXRT_LPADC_SWTRIG_SWT7                 (1 << 7)                                   /* Trigger 7 event generated. */

#define IMXRT_LPADC_CMDL1_ADCH_MASK             (0x1f)
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_0           (0x0)                                      /* Select CH0A or CH0B or CH0A/CH0B pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_1           (0x1)                                      /* Select CH1A or CH1B or CH1A/CH1B pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_2           (0x2)                                      /* Select CH2A or CH2B or CH2A/CH2B pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_3           (0x3)                                      /* Select CH3A or CH3B or CH3A/CH3B pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_4           (0x4)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_5           (0x5)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_6           (0x6)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_7           (0x7)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_8           (0x8)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_9           (0x9)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_30          (0x1e)                                     /* Select CH30A or CH30B or CH30A/CH30B pair. */
#define IMXRT_LPADC_CMDL1_ADCH_ADCH_31          (0x1f)                                     /* Select CH31A or CH31B or CH31A/CH31B pair. */
#define IMXRT_LPADC_CMDL1_ABSEL                 (1 << 5)                                   /* When DIFF=0b0, the associated B-side channel is converted as single-ended. When DIFF=0b1, the ADC result is (CHnB-CHnA). */
#define IMXRT_LPADC_CMDL1_DIFF                  (1 << 6)                                   /* Differential mode. */
#define IMXRT_LPADC_CMDL1_CSCALE                (1 << 13)                                  /* (Default) Full scale (Factor of 1) */

#define IMXRT_LPADC_CMDH1_CMPEN_MASK            (0x03)
#define IMXRT_LPADC_CMDH1_CMPEN_CMPEN_0         (0x0)                                      /* Compare disabled. */
#define IMXRT_LPADC_CMDH1_CMPEN_CMPEN_2         (0x2)                                      /* Compare enabled. Store on true. */
#define IMXRT_LPADC_CMDH1_CMPEN_CMPEN_3         (0x3)                                      /* Compare enabled. Repeat channel acquisition (sample/convert/compare) until true. */
#define IMXRT_LPADC_CMDH1_LWI                   (1 << 7)                                   /* Auto channel increment enabled */
#define IMXRT_LPADC_CMDH1_STS_SHIFT             (8)                                        /* Sample Time Select */
#define IMXRT_LPADC_CMDH1_STS_MASK              (0x07 << IMXRT_LPADC_CMDH1_STS_SHIFT)
#define IMXRT_LPADC_CMDH1_STS_STS_0             (0x0 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* Minimum sample time of 3 ADCK cycles. */
#define IMXRT_LPADC_CMDH1_STS_STS_1             (0x1 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 21 ADCK cycles; 5 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_STS_STS_2             (0x2 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 22 ADCK cycles; 7 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_STS_STS_3             (0x3 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 23 ADCK cycles; 11 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_STS_STS_4             (0x4 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 24 ADCK cycles; 19 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_STS_STS_5             (0x5 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 25 ADCK cycles; 35 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_STS_STS_6             (0x6 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 26 ADCK cycles; 67 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_STS_STS_7             (0x7 << IMXRT_LPADC_CMDH1_STS_SHIFT)       /* 3 + 27 ADCK cycles; 131 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH1_AVGS_SHIFT            (12)                                       /* Hardware Average Select */
#define IMXRT_LPADC_CMDH1_AVGS_MASK             (0x07 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_0           (0x0 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* Single conversion. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_1           (0x1 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 2 conversions averaged. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_2           (0x2 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 4 conversions averaged. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_3           (0x3 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 8 conversions averaged. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_4           (0x4 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 16 conversions averaged. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_5           (0x5 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 32 conversions averaged. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_6           (0x6 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 64 conversions averaged. */
#define IMXRT_LPADC_CMDH1_AVGS_AVGS_7           (0x7 << IMXRT_LPADC_CMDH1_AVGS_SHIFT)      /* 128 conversions averaged. */
#define IMXRT_LPADC_CMDH1_LOOP_SHIFT            (16)                                       /* Loop Count Select */
#define IMXRT_LPADC_CMDH1_LOOP_MASK             (0x0f << IMXRT_LPADC_CMDH1_LOOP_SHIFT)
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_0           (0x0 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Looping not enabled. Command executes 1 time. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_1           (0x1 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop 1 time. Command executes 2 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_2           (0x2 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop 2 times. Command executes 3 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_3           (0x3 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_4           (0x4 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_5           (0x5 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_6           (0x6 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_7           (0x7 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_8           (0x8 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_9           (0x9 << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH1_LOOP_LOOP_15          (0xf << IMXRT_LPADC_CMDH1_LOOP_SHIFT)      /* Loop 15 times. Command executes 16 times. */
#define IMXRT_LPADC_CMDH1_NEXT_SHIFT            (24)                                       /* Next Command Select */
#define IMXRT_LPADC_CMDH1_NEXT_MASK             (0x0f << IMXRT_LPADC_CMDH1_NEXT_SHIFT)
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_0           (0x0 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger. */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_1           (0x1 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select CMD1 command buffer register as next command. */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_2           (0x2 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_3           (0x3 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_4           (0x4 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_5           (0x5 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_6           (0x6 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_7           (0x7 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_8           (0x8 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_9           (0x9 << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH1_NEXT_NEXT_15          (0xf << IMXRT_LPADC_CMDH1_NEXT_SHIFT)      /* Select CMD15 command buffer register as next command. */

