apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_adc_ver2.h
#define IMXRT_LPADC_CMDL2_ADCH_MASK             (0x1f)
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_0           (0x0)                                      /* Select CH0A or CH0B or CH0A/CH0B pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_1           (0x1)                                      /* Select CH1A or CH1B or CH1A/CH1B pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_2           (0x2)                                      /* Select CH2A or CH2B or CH2A/CH2B pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_3           (0x3)                                      /* Select CH3A or CH3B or CH3A/CH3B pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_4           (0x4)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_5           (0x5)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_6           (0x6)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_7           (0x7)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_8           (0x8)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_9           (0x9)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_30          (0x1e)                                     /* Select CH30A or CH30B or CH30A/CH30B pair. */
#define IMXRT_LPADC_CMDL2_ADCH_ADCH_31          (0x1f)                                     /* Select CH31A or CH31B or CH31A/CH31B pair. */
#define IMXRT_LPADC_CMDL2_ABSEL                 (1 << 5)                                   /* When DIFF=0b0, the associated B-side channel is converted as single-ended. When DIFF=0b1, the ADC result is (CHnB-CHnA). */
#define IMXRT_LPADC_CMDL2_DIFF                  (1 << 6)                                   /* Differential mode. */
#define IMXRT_LPADC_CMDL2_CSCALE                (1 << 13)                                  /* (Default) Full scale (Factor of 1) */

#define IMXRT_LPADC_CMDH2_CMPEN_MASK            (0x03)
#define IMXRT_LPADC_CMDH2_CMPEN_CMPEN_0         (0x0)                                      /* Compare disabled. */
#define IMXRT_LPADC_CMDH2_CMPEN_CMPEN_2         (0x2)                                      /* Compare enabled. Store on true. */
#define IMXRT_LPADC_CMDH2_CMPEN_CMPEN_3         (0x3)                                      /* Compare enabled. Repeat channel acquisition (sample/convert/compare) until true. */
#define IMXRT_LPADC_CMDH2_LWI                   (1 << 7)                                   /* Auto channel increment enabled */
#define IMXRT_LPADC_CMDH2_STS_SHIFT             (8)                                        /* Sample Time Select */
#define IMXRT_LPADC_CMDH2_STS_MASK              (0x07 << IMXRT_LPADC_CMDH2_STS_SHIFT)
#define IMXRT_LPADC_CMDH2_STS_STS_0             (0x0 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* Minimum sample time of 3 ADCK cycles. */
#define IMXRT_LPADC_CMDH2_STS_STS_1             (0x1 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 21 ADCK cycles; 5 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_STS_STS_2             (0x2 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 22 ADCK cycles; 7 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_STS_STS_3             (0x3 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 23 ADCK cycles; 11 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_STS_STS_4             (0x4 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 24 ADCK cycles; 19 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_STS_STS_5             (0x5 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 25 ADCK cycles; 35 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_STS_STS_6             (0x6 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 26 ADCK cycles; 67 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_STS_STS_7             (0x7 << IMXRT_LPADC_CMDH2_STS_SHIFT)       /* 3 + 27 ADCK cycles; 131 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH2_AVGS_SHIFT            (12)                                       /* Hardware Average Select */
#define IMXRT_LPADC_CMDH2_AVGS_MASK             (0x07 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_0           (0x0 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* Single conversion. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_1           (0x1 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 2 conversions averaged. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_2           (0x2 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 4 conversions averaged. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_3           (0x3 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 8 conversions averaged. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_4           (0x4 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 16 conversions averaged. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_5           (0x5 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 32 conversions averaged. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_6           (0x6 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 64 conversions averaged. */
#define IMXRT_LPADC_CMDH2_AVGS_AVGS_7           (0x7 << IMXRT_LPADC_CMDH2_AVGS_SHIFT)      /* 128 conversions averaged. */
#define IMXRT_LPADC_CMDH2_LOOP_SHIFT            (16)                                       /* Loop Count Select */
#define IMXRT_LPADC_CMDH2_LOOP_MASK             (0x0f << IMXRT_LPADC_CMDH2_LOOP_SHIFT)
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_0           (0x0 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Looping not enabled. Command executes 1 time. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_1           (0x1 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop 1 time. Command executes 2 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_2           (0x2 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop 2 times. Command executes 3 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_3           (0x3 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_4           (0x4 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_5           (0x5 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_6           (0x6 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_7           (0x7 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_8           (0x8 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_9           (0x9 << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH2_LOOP_LOOP_15          (0xf << IMXRT_LPADC_CMDH2_LOOP_SHIFT)      /* Loop 15 times. Command executes 16 times. */
#define IMXRT_LPADC_CMDH2_NEXT_SHIFT            (24)                                       /* Next Command Select */
#define IMXRT_LPADC_CMDH2_NEXT_MASK             (0x0f << IMXRT_LPADC_CMDH2_NEXT_SHIFT)
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_0           (0x0 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger. */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_1           (0x1 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select CMD1 command buffer register as next command. */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_2           (0x2 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_3           (0x3 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_4           (0x4 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_5           (0x5 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_6           (0x6 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_7           (0x7 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_8           (0x8 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_9           (0x9 << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH2_NEXT_NEXT_15          (0xf << IMXRT_LPADC_CMDH2_NEXT_SHIFT)      /* Select CMD15 command buffer register as next command. */

#define IMXRT_LPADC_CMDL3_ADCH_MASK             (0x1f)
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_0           (0x0)                                      /* Select CH0A or CH0B or CH0A/CH0B pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_1           (0x1)                                      /* Select CH1A or CH1B or CH1A/CH1B pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_2           (0x2)                                      /* Select CH2A or CH2B or CH2A/CH2B pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_3           (0x3)                                      /* Select CH3A or CH3B or CH3A/CH3B pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_4           (0x4)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_5           (0x5)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_6           (0x6)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_7           (0x7)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_8           (0x8)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_9           (0x9)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_30          (0x1e)                                     /* Select CH30A or CH30B or CH30A/CH30B pair. */
#define IMXRT_LPADC_CMDL3_ADCH_ADCH_31          (0x1f)                                     /* Select CH31A or CH31B or CH31A/CH31B pair. */
#define IMXRT_LPADC_CMDL3_ABSEL                 (1 << 5)                                   /* When DIFF=0b0, the associated B-side channel is converted as single-ended. When DIFF=0b1, the ADC result is (CHnB-CHnA). */
#define IMXRT_LPADC_CMDL3_DIFF                  (1 << 6)                                   /* Differential mode. */
#define IMXRT_LPADC_CMDL3_CSCALE                (1 << 13)                                  /* (Default) Full scale (Factor of 1) */

#define IMXRT_LPADC_CMDH3_CMPEN_MASK            (0x03)
#define IMXRT_LPADC_CMDH3_CMPEN_CMPEN_0         (0x0)                                      /* Compare disabled. */
#define IMXRT_LPADC_CMDH3_CMPEN_CMPEN_2         (0x2)                                      /* Compare enabled. Store on true. */
#define IMXRT_LPADC_CMDH3_CMPEN_CMPEN_3         (0x3)                                      /* Compare enabled. Repeat channel acquisition (sample/convert/compare) until true. */
#define IMXRT_LPADC_CMDH3_LWI                   (1 << 7)                                   /* Auto channel increment enabled */
#define IMXRT_LPADC_CMDH3_STS_SHIFT             (8)                                        /* Sample Time Select */
#define IMXRT_LPADC_CMDH3_STS_MASK              (0x07 << IMXRT_LPADC_CMDH3_STS_SHIFT)
#define IMXRT_LPADC_CMDH3_STS_STS_0             (0x0 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* Minimum sample time of 3 ADCK cycles. */
#define IMXRT_LPADC_CMDH3_STS_STS_1             (0x1 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 21 ADCK cycles; 5 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_STS_STS_2             (0x2 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 22 ADCK cycles; 7 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_STS_STS_3             (0x3 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 23 ADCK cycles; 11 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_STS_STS_4             (0x4 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 24 ADCK cycles; 19 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_STS_STS_5             (0x5 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 25 ADCK cycles; 35 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_STS_STS_6             (0x6 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 26 ADCK cycles; 67 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_STS_STS_7             (0x7 << IMXRT_LPADC_CMDH3_STS_SHIFT)       /* 3 + 27 ADCK cycles; 131 ADCK cycles total sample time. */
#define IMXRT_LPADC_CMDH3_AVGS_SHIFT            (12)                                       /* Hardware Average Select */
#define IMXRT_LPADC_CMDH3_AVGS_MASK             (0x07 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_0           (0x0 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* Single conversion. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_1           (0x1 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 2 conversions averaged. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_2           (0x2 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 4 conversions averaged. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_3           (0x3 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 8 conversions averaged. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_4           (0x4 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 16 conversions averaged. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_5           (0x5 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 32 conversions averaged. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_6           (0x6 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 64 conversions averaged. */
#define IMXRT_LPADC_CMDH3_AVGS_AVGS_7           (0x7 << IMXRT_LPADC_CMDH3_AVGS_SHIFT)      /* 128 conversions averaged. */
#define IMXRT_LPADC_CMDH3_LOOP_SHIFT            (16)                                       /* Loop Count Select */
#define IMXRT_LPADC_CMDH3_LOOP_MASK             (0x0f << IMXRT_LPADC_CMDH3_LOOP_SHIFT)
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_0           (0x0 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Looping not enabled. Command executes 1 time. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_1           (0x1 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop 1 time. Command executes 2 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_2           (0x2 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop 2 times. Command executes 3 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_3           (0x3 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_4           (0x4 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_5           (0x5 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_6           (0x6 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_7           (0x7 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_8           (0x8 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_9           (0x9 << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop corresponding number of times. Command executes LOOP+1 times. */
#define IMXRT_LPADC_CMDH3_LOOP_LOOP_15          (0xf << IMXRT_LPADC_CMDH3_LOOP_SHIFT)      /* Loop 15 times. Command executes 16 times. */
#define IMXRT_LPADC_CMDH3_NEXT_SHIFT            (24)                                       /* Next Command Select */
#define IMXRT_LPADC_CMDH3_NEXT_MASK             (0x0f << IMXRT_LPADC_CMDH3_NEXT_SHIFT)
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_0           (0x0 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* No next command defined. Terminate conversions at completion of current command. If lower priority trigger pending, begin command associated with lower priority trigger. */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_1           (0x1 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select CMD1 command buffer register as next command. */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_2           (0x2 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_3           (0x3 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_4           (0x4 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_5           (0x5 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_6           (0x6 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_7           (0x7 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_8           (0x8 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_9           (0x9 << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select corresponding CMD command buffer register as next command */
#define IMXRT_LPADC_CMDH3_NEXT_NEXT_15          (0xf << IMXRT_LPADC_CMDH3_NEXT_SHIFT)      /* Select CMD15 command buffer register as next command. */

#define IMXRT_LPADC_CMDL4_ADCH_MASK             (0x1f)
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_0           (0x0)                                      /* Select CH0A or CH0B or CH0A/CH0B pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_1           (0x1)                                      /* Select CH1A or CH1B or CH1A/CH1B pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_2           (0x2)                                      /* Select CH2A or CH2B or CH2A/CH2B pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_3           (0x3)                                      /* Select CH3A or CH3B or CH3A/CH3B pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_4           (0x4)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_5           (0x5)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_6           (0x6)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_7           (0x7)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_8           (0x8)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_9           (0x9)                                      /* Select corresponding channel CHnA or CHnB or CHnA/CHnB pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_30          (0x1e)                                     /* Select CH30A or CH30B or CH30A/CH30B pair. */
#define IMXRT_LPADC_CMDL4_ADCH_ADCH_31          (0x1f)                                     /* Select CH31A or CH31B or CH31A/CH31B pair. */
#define IMXRT_LPADC_CMDL4_ABSEL                 (1 << 5)                                   /* When DIFF=0b0, the associated B-side channel is converted as single-ended. When DIFF=0b1, the ADC result is (CHnB-CHnA). */
#define IMXRT_LPADC_CMDL4_DIFF                  (1 << 6)                                   /* Differential mode. */
#define IMXRT_LPADC_CMDL4_CSCALE                (1 << 13)                                  /* (Default) Full scale (Factor of 1) */

