apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_adc_ver2.h
#define IMXRT_LPADC_RESFIFO_D_MASK              (0xffff)                                   /* Data result */
#define IMXRT_LPADC_RESFIFO_TSRC_SHIFT          (16)                                       /* Trigger Source */
#define IMXRT_LPADC_RESFIFO_TSRC_MASK           (0x07 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_0         (0x0 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Trigger source 0 initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_1         (0x1 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Trigger source 1 initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_2         (0x2 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Corresponding trigger source initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_3         (0x3 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Corresponding trigger source initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_4         (0x4 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Corresponding trigger source initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_5         (0x5 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Corresponding trigger source initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_6         (0x6 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Corresponding trigger source initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_TSRC_TSRC_7         (0x7 << IMXRT_LPADC_RESFIFO_TSRC_SHIFT)    /* Trigger source 7 initiated this conversion. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT       (20)                                       /* Loop count value */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_MASK        (0x0f << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT)
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_0   (0x0 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from initial conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_1   (0x1 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from second conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_2   (0x2 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_3   (0x3 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_4   (0x4 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_5   (0x5 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_6   (0x6 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_7   (0x7 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_8   (0x8 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_9   (0x9 << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from LOOPCNT+1 conversion in command. */
#define IMXRT_LPADC_RESFIFO_LOOPCNT_LOOPCNT_15  (0xf << IMXRT_LPADC_RESFIFO_LOOPCNT_SHIFT) /* Result is from 16th conversion in command. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT        (24)                                       /* Command Buffer Source */
#define IMXRT_LPADC_RESFIFO_CMDSRC_MASK         (0x0f << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_0     (0x0 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Not a valid value CMDSRC value for a dataword in RESFIFO. 0x0 is only found in initial FIFO state prior to an ADC conversion result dataword being stored to a RESFIFO buffer. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_1     (0x1 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* CMD1 buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_2     (0x2 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_3     (0x3 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_4     (0x4 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_5     (0x5 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_6     (0x6 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_7     (0x7 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_8     (0x8 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_9     (0x9 << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* Corresponding command buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_CMDSRC_CMDSRC_15    (0xf << IMXRT_LPADC_RESFIFO_CMDSRC_SHIFT)  /* CMD15 buffer used as control settings for this conversion. */
#define IMXRT_LPADC_RESFIFO_VALID               (1 << 31)                                  /* FIFO record read from RESFIFO is valid. */

#define IMXRT_LPADC_TCTRL0_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL0_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL0_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL0_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL0_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL0_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL0_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL0_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL0_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL0_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL0_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL0_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL0_TCMD_SHIFT)     /* CMD15 is executed */

#define IMXRT_LPADC_TCTRL1_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL1_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL1_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL1_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL1_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL1_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL1_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL1_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL1_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL1_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL1_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL1_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL1_TCMD_SHIFT)     /* CMD15 is executed */

#define IMXRT_LPADC_TCTRL2_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL2_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL2_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL2_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL2_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL2_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL2_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL2_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL2_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL2_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL2_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL2_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL2_TCMD_SHIFT)     /* CMD15 is executed */

