apache/nuttx/arch/arm/src/imxrt/hardware/imxrt_adc_ver2.h
#define IMXRT_LPADC_TCTRL3_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL3_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL3_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL3_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL3_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL3_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL3_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL3_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL3_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL3_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL3_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL3_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL3_TCMD_SHIFT)     /* CMD15 is executed */

#define IMXRT_LPADC_TCTRL4_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL4_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL4_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL4_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL4_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL4_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL4_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL4_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL4_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL4_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL4_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL4_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL4_TCMD_SHIFT)     /* CMD15 is executed */

#define IMXRT_LPADC_TCTRL5_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL5_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL5_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL5_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL5_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL5_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL5_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL5_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL5_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL5_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL5_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL5_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL5_TCMD_SHIFT)     /* CMD15 is executed */

#define IMXRT_LPADC_TCTRL6_HTEN                 (1 << 0)                                   /* Hardware trigger source enabled */
#define IMXRT_LPADC_TCTRL6_CMD_SEL              (1 << 1)                                   /* Software TCDM is bypassed , and hardware TCMD from ADC_ETC module will be used. The trigger command is then defined by ADC hardware trigger command selection field in ADC_ETC->TRIGx_CHAINy_z_n[CSEL]. */
#define IMXRT_LPADC_TCTRL6_TPRI_SHIFT           (8)                                        /* Trigger priority setting */
#define IMXRT_LPADC_TCTRL6_TPRI_MASK            (0x07 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_0          (0x0 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to highest priority, Level 1 */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_1          (0x1 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_2          (0x2 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_3          (0x3 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_4          (0x4 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_5          (0x5 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_6          (0x6 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to corresponding priority level */
#define IMXRT_LPADC_TCTRL6_TPRI_TPRI_7          (0x7 << IMXRT_LPADC_TCTRL6_TPRI_SHIFT)     /* Set to lowest priority, Level 8 */
#define IMXRT_LPADC_TCTRL6_TDLY_SHIFT           (16)                                       /* Trigger delay select */
#define IMXRT_LPADC_TCTRL6_TDLY_MASK            (0x0f << IMXRT_LPADC_TCTRL6_TDLY_SHIFT)
#define IMXRT_LPADC_TCTRL6_TCMD_SHIFT           (24)                                       /* Trigger command select */
#define IMXRT_LPADC_TCTRL6_TCMD_MASK            (0x0f << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_0          (0x0 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Not a valid selection from the command buffer. Trigger event is ignored. */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_1          (0x1 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* CMD1 is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_2          (0x2 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_3          (0x3 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_4          (0x4 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_5          (0x5 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_6          (0x6 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_7          (0x7 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_8          (0x8 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_9          (0x9 << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* Corresponding CMD is executed */
#define IMXRT_LPADC_TCTRL6_TCMD_TCMD_15         (0xf << IMXRT_LPADC_TCTRL6_TCMD_SHIFT)     /* CMD15 is executed */

